In [1]:
n=int(input("enter data"))
print("the value is:",n)

enter data12
the value is: 12

In [2]:
type(n)

int

In [4]:
n1=100
type(n1)

int

In [5]:
n2=12.90
type(n2)

float

In [6]:
n3="hello world"
type(n3)

str

In [7]:
#variable
n=100  #n is variable 
type(n)

int

In [9]:
#rule of variable name
#start with _ or alp,cannot be start with numbers
#variable name contains alp,num,_
#var_name cannot be any python keyword
_var="Hello all"
print(type(_var))

<class 'str'>

In [10]:
type(_var)

str

In [11]:
#number int
n=100
print(type(n))

<class 'int'>

In [12]:
#number-float
n=100.90
print(type(n))

<class 'float'>

In [13]:
#number-string
n="100"
print(type(n))

<class 'str'>

In [19]:
#type casting-a one data type converted into another data type of int float,string or boolean is called as type casting or type conversion
n=100
print(n)
type_ca=float(n)
print(type_ca)

100
100.0

In [22]:
#string
string="the most beautiful thing in the world is   "
print(string)

the most beautiful thing in the world is

In [25]:
#len

string="hello all"
len(string)#including space

9

In [34]:
#modularity strings
#lower
n=" navitha kaveri"
print(n.lower())
print(n.upper())
print(n.capitalize())
print(n.split(" "))#return the values into list 
print(n.strip())

 navitha kaveri
 NAVITHA KAVERI
 navitha kaveri
['', 'navitha', 'kaveri']
navitha kaveri

In [38]:
#concat-combining 2 strings
str1="navitha"
str2="naveen"
con=str1+" "+str2#type1 wiith spacing
print(con)
con1=str1+str2#type 2 without space
print(con1)

navitha naveen
navithanaveen

In [39]:
#slicking-return the range of the character of given string
s="this msg for you"
print(s[0:12]) #startindex:end index:step

this msg for

In [40]:
print(s[0: :2]) # start index # end index till last # step 2 every 2nd values return

ti s o o

In [41]:
print(s[ : :3])

tssf u

In [43]:
#check in and not in 
string="hello all this is navitha from chennai"
if "navitha" in string:
    print("yes")
else:
    print("no")

yes

In [44]:
#check in and not in 
string="hello all this is navitha from chennai"
if "navitha" not in string:
    print("yes")
else:
    print("no")

no

In [46]:
#data structure
#built in data structures
#list append
list1=["tv","fridge","washing_machine","fan"]
print(list1)

['tv', 'fridge', 'washing_machine', 'fan']

In [47]:
list1.append("table")

In [48]:
list1

['tv', 'fridge', 'washing_machine', 'fan', 'table']

In [49]:
#pop
list1.pop()

'table'

In [50]:
list1

['tv', 'fridge', 'washing_machine', 'fan']

In [51]:
list1.pop(1)

'fridge'

In [52]:
list1

['tv', 'washing_machine', 'fan']

In [53]:
list2=[100,200,1,23,23,10]
print(min(list2))

1

In [54]:
list2=[100,200,1,23,23,10]
print(max(list2))

200

In [55]:
list2.copy()

[100, 200, 1, 23, 23, 10]

In [56]:
list2.count(23)

2

In [58]:
list2.index(23)

3

In [60]:
list2.sort(reverse=True)
list2

[200, 100, 23, 23, 10, 1]

In [61]:
list2.sort(reverse=False)
list2

[1, 10, 23, 23, 100, 200]

In [64]:
list3=[1,8,4,6,90]
print(list3)
list3.reverse()
print(list3)

[1, 8, 4, 6, 90]
[90, 6, 4, 8, 1]

In [65]:
#tuple
t=(100,"people","290",True)
t.count(100)

1

In [66]:
t.index(100)

0

In [67]:
t.index("people")

1

In [69]:
#set
se1={100,200,"management","team",False}
se2={100,2001,"team",True}

In [70]:
se2.add("collabration")

In [71]:
se2

{100, 2001, True, 'collabration', 'team'}

In [72]:
se2.copy()

{100, 2001, True, 'collabration', 'team'}

In [73]:
se1.union(se2)

{100, 200, 2001, False, True, 'collabration', 'management', 'team'}

In [74]:
se1.intersection(se2)

{100, 'team'}

In [75]:
se1.difference(se2)

{200, False, 'management'}

In [76]:
se1

{100, 200, False, 'management', 'team'}

In [77]:
se2

{100, 2001, True, 'collabration', 'team'}

In [79]:
se1.issubset(se2)

False

In [80]:
se1.issuperset(se2)

False

In [81]:
s1={1,2,3}
s2={1,2,3,4}
s1.issubset(s2)

True

In [82]:
s1={1,2,3}
s2={1,2,3,4}
s1.issuperset(s2)

False

In [84]:

s1.pop()

1

In [85]:
s1

{2, 3}

In [86]:
s1.pop()

2

In [89]:
#dictionary
dic1={"name":"navitha","age":28}
dic1

{'name': 'navitha', 'age': 28}

In [92]:
dic1.update({"name":"naveen","age":28})

In [93]:
dic1

{'name': 'naveen', 'age': 28}

In [94]:
dict.items

In [95]:
dic1.values()

dict_values(['naveen', 28])

In [96]:
dic1.keys()

dict_keys(['name', 'age'])

In [97]:
dic1.get("name")

'naveen'

In [98]:
#conditional statement
a=12
if a>10:
    print("success")

success

In [100]:
a=9
if a>10:
    print("success")
else:
    print("unsuccess")

unsuccess

In [101]:
a=int(input("enter the value"))
if a==0:
    print("ok")
else:
    print("not ok")

enter the value100
not ok

In [103]:
a=int(input("enter the value"))
if a%2==0:
    print("even")
else:
    print("odd")

enter the value7
odd

In [106]:
a=int(input("enter"))
if a<100 and a>50:
    print("a grade")
elif a>30 and a<49:
    print("c grade")
else:
    print("fail")

enter45
c grade

In [107]:
#loops

for i in range(6):
    print(i)

0
1
2
3
4
5

In [108]:
for i in range(0,10,2):
    print(i)

0
2
4
6
8

In [111]:
list1=["a","n","b","d","e"]
for i in list1:
    print(i)

a
n
b
d
e

In [113]:
list1=["a","n","b","d","e"]
for i in list1: print(i)

a
n
b
d
e

In [114]:
a=4
while a<6:
    print(a)
    a=a+1

4
5

In [1]:
#function
def atte(a,b):
    re=a*b
    return re
   



aa=int(input("enter"))
bb=int(input("enter"))
cat=atte(aa,bb)
print(cat)

enter100
enter100
10000

In [2]:
for i in range(10):
    if i==5:
        break
    print(i)

0
1
2
3
4

In [3]:
list1=[1,2,3]
ep=[list1[i] for i in range(0,len(list1))]
print("the new list is:",ep)

the new list is: [1, 2, 3]

In [11]:
file=pd.read_csv(r"C:\Users\navit\Downloads\singapore.csv")
import pandas as pd
data=pd.DataFrame(file)
data

C:\Users\navit\AppData\Local\Temp\ipykernel_26220\2007334746.py:1: DtypeWarning: Columns (9) have mixed types. Specify dtype option on import or set low_memory=False.
  file=pd.read_csv(r"C:\Users\navit\Downloads\singapore.csv")

,month,town,flat_type,block,street_name,storey_range,floor_area_sqm,flat_model,lease_commence_date,remaining,resale_price
0,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,NaN,9000.0
1,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,04 TO 06,31.0,IMPROVED,1977,NaN,6000.0
2,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,10 TO 12,31.0,IMPROVED,1977,NaN,8000.0
3,1990-01,ANG MO KIO,1 ROOM,309,ANG MO KIO AVE 1,07 TO 09,31.0,IMPROVED,1977,NaN,6000.0
4,1990-01,ANG MO KIO,3 ROOM,216,ANG MO KIO AVE 1,04 TO 06,73.0,NEW GENERATION,1976,NaN,47200.0
...,...,...,...,...,...,...,...,...,...,...,...
925884,2024-04,YISHUN,EXECUTIVE,826,YISHUN ST 81,04 TO 06,146.0,Maisonette,1988,62 years 10 months,900000.0
925885,2024-04,YISHUN,EXECUTIVE,836,YISHUN ST 81,04 TO 06,142.0,Apartment,1988,62 years 10 months,805000.0
925886,2024-05,YISHUN,EXECUTIVE,834,YISHUN ST 81,04 TO 06,154.0,Maisonette,1988,62 years 09 months,948000.0
925887,2024-02,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,04 TO 06,164.0,Multi Generation,1987,62 years 11 months,998000.0
925888,2024-03,YISHUN,MULTI-GENERATION,666,YISHUN AVE 4,10 TO 12,164.0,Multi Generation,1987,62 years 09 months,1200000.0

In [23]:
from openpyxl import load_workbook

# Open the Excel file
workbook = load_workbook("book1.xlsx")

# Access a sheet
sheet = workbook.active  # Get the active sheet

# Read data
for row in sheet.iter_rows(values_only=True):
    print(row)

('We require the share amount to be provided before the marriage',)
(None,)
('For critical illnesses, we request medical leave without it being deducted from our regular leave balance',)
('Employees feel disheartened if medical leave for critical illnesses is deducted from their regular leave balance, forcing them to endure a loss of pay (LOP',)
(None,)
('During permission hours, cab drop services need to be extended to Periyapalaiyam and Uthukottai.',)
(None,)
('We request an increase in marriage leave from 10 days to 15 days',)
(None,)
('We request the provision of crèche facilities for employees working in the C shift to ensure proper childcare support during late hours',)
(None,)
('There is an issue with mold lifting and inadequate ventilation that needs to be addressed for a healthier and safer environment.',)
(None,)
('Employees are unhappy with the reduction in their RL (Regular Leave) balance and have expressed concerns about the change',)

In [22]:
from openpyxl import load_workbook
with open("book1.xlsx","r") as file:
    content=file.read()
    print(content)

UnicodeDecodeError: 'charmap' codec can't decode byte 0x9d in position 16: character maps to <undefined>

In [24]:

with open("Book1.csv","r") as file:
    content=file.read()
    print(content)

date,grade,amount
08-01-2025,a,100
09-01-2025,b,101
10-01-2025,c,102
11-01-2025,d,103
12-01-2025,e,104
13-01-2025,f,105

In [29]:
with open("Book1.csv","w") as file:
    file.write("hello")

In [30]:

with open("Book1.csv","r") as file:
    content=file.read()
    print(content)

hello

In [31]:
import pandas as pd
dat=pd.read_csv(r"Book1.csv")
dat

Empty DataFrame
Columns: [hello]
Index: []

In [33]:
with open("Book1.csv","a") as file:
    file.write("all")

In [34]:
import pandas as pd
dat=pd.read_csv(r"Book1.csv")
dat

Empty DataFrame
Columns: [helloall]
Index: []

In [38]:
#lamda
vari=lambda x:x**3
x=100
print(vari(x))

1000000

In [41]:
sam=[1,2,3,4,5,6]
rest=list(filter(lambda x:x%2==0,sam))

In [42]:
rest

[2, 4, 6]

In [43]:
#pandas
import pandas as pd
import numpy as np
series=np.array(['hello',1,3,'navitha','100',True])
s=pd.Series(series)
print(s)

0      hello
1          1
2          3
3    navitha
4        100
5       True
dtype: object

In [46]:
#dataframe
data=pd.DataFrame({"name":"navitha","age":29,"gender":"Female"})
data

ValueError: If using all scalar values, you must pass an index

In [66]:
data=[["navitha","BCA","Engineer",30000],
     ["naveen","Dip","Coodinator",40000],
     ["divya","Engineering","teamleader",40000]]

df=pd.DataFrame(data,columns=['NAME','EDUCATION','WORKING','SALARY'])
print(df)

      NAME    EDUCATION     WORKING  SALARY
0  navitha          BCA    Engineer   30000
1   naveen          Dip  Coodinator   40000
2    divya  Engineering  teamleader   40000

In [45]:
name=["navitha","naveen","divya","siva"]
age=[29,28,27,30]
data=pd.DataFrame({"Emp_name":name,"Age":age})
data

  Emp_name  Age
0  navitha   29
1   naveen   28
2    divya   27
3     siva   30

In [49]:
df=pd.read_csv(r"C:\Users\navit\Downloads\Customers.csv")

In [50]:
df

  CustomerID CustomerName      City Country
0         C1     John Doe  New York     USA
1         C2   Jane Smith    London      UK
2         C3  Carlos Diaz    Madrid   Spain

In [51]:
df.head()

  CustomerID CustomerName      City Country
0         C1     John Doe  New York     USA
1         C2   Jane Smith    London      UK
2         C3  Carlos Diaz    Madrid   Spain

In [52]:
df.head(2)

  CustomerID CustomerName      City Country
0         C1     John Doe  New York     USA
1         C2   Jane Smith    London      UK

In [53]:
df.tail()

  CustomerID CustomerName      City Country
0         C1     John Doe  New York     USA
1         C2   Jane Smith    London      UK
2         C3  Carlos Diaz    Madrid   Spain

In [54]:
df.tail(1)

  CustomerID CustomerName    City Country
2         C3  Carlos Diaz  Madrid   Spain

In [55]:
df.describe()

       CustomerID CustomerName      City Country
count           3            3         3       3
unique          3            3         3       3
top            C1     John Doe  New York     USA
freq            1            1         1       1

In [59]:
df.columns

Index(['CustomerID', 'CustomerName', 'City', 'Country'], dtype='object')

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   CustomerID    3 non-null      object
 1   CustomerName  3 non-null      object
 2   City          3 non-null      object
 3   Country       3 non-null      object
dtypes: object(4)
memory usage: 228.0+ bytes

In [68]:
df

      NAME    EDUCATION     WORKING  SALARY
0  navitha          BCA    Engineer   30000
1   naveen          Dip  Coodinator   40000
2    divya  Engineering  teamleader   40000

In [69]:
df['NAME']

0    navitha
1     naveen
2      divya
Name: NAME, dtype: object

In [70]:
df['EDUCATION']

0            BCA
1            Dip
2    Engineering
Name: EDUCATION, dtype: object

In [72]:
df.iloc[0]

NAME          navitha
EDUCATION         BCA
WORKING      Engineer
SALARY          30000
Name: 0, dtype: object

In [73]:
df.iloc[2]

NAME               divya
EDUCATION    Engineering
WORKING       teamleader
SALARY             40000
Name: 2, dtype: object

In [75]:
df.loc[2]

NAME               divya
EDUCATION    Engineering
WORKING       teamleader
SALARY             40000
Name: 2, dtype: object

In [81]:
df.iloc[0]

NAME          navitha
EDUCATION         BCA
WORKING      Engineer
SALARY          30000
Name: 0, dtype: object

In [ ]:
print(df[df['Age'] > 30])

In [85]:
#filter
print(df[df['SALARY']>30000])

     NAME    EDUCATION     WORKING  SALARY
1  naveen          Dip  Coodinator   40000
2   divya  Engineering  teamleader   40000

In [86]:
new_data=pd.read_csv(r"C:\Users\navit\Downloads\car_price_prediction_.csv")

In [87]:
new_data

,Car ID,Brand,Year,Engine Size,Fuel Type,Transmission,Mileage,Condition,Price,Model
0,1,Tesla,2016,2.3,Petrol,Manual,114832,New,26613.92,Model X
1,2,BMW,2018,4.4,Electric,Manual,143190,Used,14679.61,5 Series
2,3,Audi,2013,4.5,Electric,Manual,181601,New,44402.61,A4
3,4,Tesla,2011,4.1,Diesel,Automatic,68682,New,86374.33,Model Y
4,5,Ford,2009,2.6,Diesel,Manual,223009,Like New,73577.10,Mustang
...,...,...,...,...,...,...,...,...,...,...
2495,2496,Audi,2020,2.4,Petrol,Automatic,22650,Like New,61384.10,Q5
2496,2497,Audi,2001,5.7,Hybrid,Manual,77701,Like New,24710.35,A3
2497,2498,Ford,2021,1.1,Hybrid,Manual,272827,Like New,29902.45,Fiesta
2498,2499,Audi,2002,4.5,Diesel,Manual,229164,Like New,46085.67,Q5
2499,2500,Toyota,2005,4.6,Diesel,Automatic,80978,Used,16594.14,RAV4

In [88]:
#viewing of data
new_data.head()

,Car ID,Brand,Year,Engine Size,Fuel Type,Transmission,Mileage,Condition,Price,Model
0,1,Tesla,2016,2.3,Petrol,Manual,114832,New,26613.92,Model X
1,2,BMW,2018,4.4,Electric,Manual,143190,Used,14679.61,5 Series
2,3,Audi,2013,4.5,Electric,Manual,181601,New,44402.61,A4
3,4,Tesla,2011,4.1,Diesel,Automatic,68682,New,86374.33,Model Y
4,5,Ford,2009,2.6,Diesel,Manual,223009,Like New,73577.10,Mustang

In [89]:
new_data.tail()

,Car ID,Brand,Year,Engine Size,Fuel Type,Transmission,Mileage,Condition,Price,Model
2495,2496,Audi,2020,2.4,Petrol,Automatic,22650,Like New,61384.10,Q5
2496,2497,Audi,2001,5.7,Hybrid,Manual,77701,Like New,24710.35,A3
2497,2498,Ford,2021,1.1,Hybrid,Manual,272827,Like New,29902.45,Fiesta
2498,2499,Audi,2002,4.5,Diesel,Manual,229164,Like New,46085.67,Q5
2499,2500,Toyota,2005,4.6,Diesel,Automatic,80978,Used,16594.14,RAV4

In [90]:
new_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2500 entries, 0 to 2499
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Car ID        2500 non-null   int64
 1   Brand         2500 non-null   object
 2   Year          2500 non-null   int64
 3   Engine Size   2500 non-null   float64
 4   Fuel Type     2500 non-null   object
 5   Transmission  2500 non-null   object
 6   Mileage       2500 non-null   int64
 7   Condition     2500 non-null   object
 8   Price         2500 non-null   float64
 9   Model         2500 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 195.4+ KB

In [ ]:
# Group and summarize
summary = df.groupby('Region')['Sales'].sum()

In [ ]:
# Merge two DataFrames
df1 = pd.DataFrame({'ID': [1, 2], 'Name': ['Alice', 'Bob']})
df2 = pd.DataFrame({'ID': [1, 2], 'Salary': [50000, 60000]})
merged = pd.merge(df1, df2, on='ID')

# Concatenate DataFrames
concatenated = pd.concat([df1, df2], axis=1)

In [ ]:
# Group by a column and calculate mean
grouped = df.groupby('Age').mean()

# Aggregating multiple statistics
aggregated = df.groupby('Age').agg({'Salary': ['mean', 'max']})

In [ ]:
# Adding a new column
df['Bonus'] = df['Salary'] * 0.1

# Modifying an existing column
df['Age'] = df['Age'] + 1

In [ ]:
# Drop a column
df = df.drop('Bonus', axis=1)

# Drop a row
df = df.drop(0, axis=0)

In [91]:
new_data.describe()

           Car ID       Year  Engine Size        Mileage         Price
count  2500.00000  2500.0000  2500.000000    2500.000000   2500.000000
mean   1250.50000  2011.6268     3.465240  149749.844800  52638.022532
std     721.83216     6.9917     1.432053   87919.952034  27295.833455
min       1.00000  2000.0000     1.000000      15.000000   5011.270000
25%     625.75000  2005.0000     2.200000   71831.500000  28908.485000
50%    1250.50000  2012.0000     3.400000  149085.000000  53485.240000
75%    1875.25000  2018.0000     4.700000  225990.500000  75838.532500
max    2500.00000  2023.0000     6.000000  299967.000000  99982.590000

In [92]:
new_data.columns

Index(['Car ID', 'Brand', 'Year', 'Engine Size', 'Fuel Type', 'Transmission',
       'Mileage', 'Condition', 'Price', 'Model'],
      dtype='object')

In [93]:
new_data.iloc[0]

Car ID                 1
Brand              Tesla
Year                2016
Engine Size          2.3
Fuel Type         Petrol
Transmission      Manual
Mileage           114832
Condition            New
Price           26613.92
Model            Model X
Name: 0, dtype: object

In [94]:
new_data.loc[0]

Car ID                 1
Brand              Tesla
Year                2016
Engine Size          2.3
Fuel Type         Petrol
Transmission      Manual
Mileage           114832
Condition            New
Price           26613.92
Model            Model X
Name: 0, dtype: object

In [95]:
new_data.iloc[0:9]

,Car ID,Brand,Year,Engine Size,Fuel Type,Transmission,Mileage,Condition,Price,Model
0,1,Tesla,2016,2.3,Petrol,Manual,114832,New,26613.92,Model X
1,2,BMW,2018,4.4,Electric,Manual,143190,Used,14679.61,5 Series
2,3,Audi,2013,4.5,Electric,Manual,181601,New,44402.61,A4
3,4,Tesla,2011,4.1,Diesel,Automatic,68682,New,86374.33,Model Y
4,5,Ford,2009,2.6,Diesel,Manual,223009,Like New,73577.10,Mustang
5,6,Audi,2019,2.4,Diesel,Automatic,246553,Like New,88969.76,Q7
6,7,Audi,2020,4.0,Electric,Automatic,135486,Used,63498.75,Q5
7,8,Tesla,2017,5.3,Hybrid,Automatic,83030,New,17381.19,Model Y
8,9,Honda,2023,5.7,Electric,Manual,120360,Like New,15905.62,Civic

In [96]:
new_data.loc[0:9]

,Car ID,Brand,Year,Engine Size,Fuel Type,Transmission,Mileage,Condition,Price,Model
0,1,Tesla,2016,2.3,Petrol,Manual,114832,New,26613.92,Model X
1,2,BMW,2018,4.4,Electric,Manual,143190,Used,14679.61,5 Series
2,3,Audi,2013,4.5,Electric,Manual,181601,New,44402.61,A4
3,4,Tesla,2011,4.1,Diesel,Automatic,68682,New,86374.33,Model Y
4,5,Ford,2009,2.6,Diesel,Manual,223009,Like New,73577.10,Mustang
5,6,Audi,2019,2.4,Diesel,Automatic,246553,Like New,88969.76,Q7
6,7,Audi,2020,4.0,Electric,Automatic,135486,Used,63498.75,Q5
7,8,Tesla,2017,5.3,Hybrid,Automatic,83030,New,17381.19,Model Y
8,9,Honda,2023,5.7,Electric,Manual,120360,Like New,15905.62,Civic
9,10,Ford,2010,1.5,Electric,Automatic,135009,Like New,9560.22,Explorer

In [100]:
#ffilter
print(new_data[new_data['Brand']=='Audi'])

      Car ID Brand  Year  Engine Size Fuel Type Transmission  Mileage  \
2          3  Audi  2013          4.5  Electric       Manual   181601
5          6  Audi  2019          2.4    Diesel    Automatic   246553
6          7  Audi  2020          4.0  Electric    Automatic   135486
13        14  Audi  2023          5.4  Electric    Automatic   263894
17        18  Audi  2022          4.4    Hybrid    Automatic   192803
...      ...   ...   ...          ...       ...          ...      ...
2487    2488  Audi  2021          4.6  Electric    Automatic     9466
2490    2491  Audi  2018          2.4    Hybrid       Manual   146539
2495    2496  Audi  2020          2.4    Petrol    Automatic    22650
2496    2497  Audi  2001          5.7    Hybrid       Manual    77701
2498    2499  Audi  2002          4.5    Diesel       Manual   229164

     Condition     Price Model
2          New  44402.61    A4
5     Like New  88969.76    Q7
6         Used  63498.75    Q5
13    Like New  70193.74    Q7
17    Like New  75044.95    A3
...        ...       ...   ...
2487      Used  15126.76    A3
2490      Used  98434.45    Q5
2495  Like New  61384.10    Q5
2496  Like New  24710.35    A3
2498  Like New  46085.67    Q5

[368 rows x 10 columns]

In [101]:
#cleaning
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   NAME       3 non-null      object
 1   EDUCATION  3 non-null      object
 2   WORKING    3 non-null      object
 3   SALARY     3 non-null      int64
dtypes: int64(1), object(3)
memory usage: 228.0+ bytes

In [104]:
new_data.isnull().sum()

Car ID          0
Brand           0
Year            0
Engine Size     0
Fuel Type       0
Transmission    0
Mileage         0
Condition       0
Price           0
Model           0
dtype: int64

In [107]:
new_data.dtypes

Car ID            int64
Brand            object
Year              int64
Engine Size     float64
Fuel Type        object
Transmission     object
Mileage           int64
Condition        object
Price           float64
Model            object
dtype: object

In [110]:
df_cle=new_data.drop_duplicates()

In [111]:
df_cle

,Car ID,Brand,Year,Engine Size,Fuel Type,Transmission,Mileage,Condition,Price,Model
0,1,Tesla,2016,2.3,Petrol,Manual,114832,New,26613.92,Model X
1,2,BMW,2018,4.4,Electric,Manual,143190,Used,14679.61,5 Series
2,3,Audi,2013,4.5,Electric,Manual,181601,New,44402.61,A4
3,4,Tesla,2011,4.1,Diesel,Automatic,68682,New,86374.33,Model Y
4,5,Ford,2009,2.6,Diesel,Manual,223009,Like New,73577.10,Mustang
...,...,...,...,...,...,...,...,...,...,...
2495,2496,Audi,2020,2.4,Petrol,Automatic,22650,Like New,61384.10,Q5
2496,2497,Audi,2001,5.7,Hybrid,Manual,77701,Like New,24710.35,A3
2497,2498,Ford,2021,1.1,Hybrid,Manual,272827,Like New,29902.45,Fiesta
2498,2499,Audi,2002,4.5,Diesel,Manual,229164,Like New,46085.67,Q5
2499,2500,Toyota,2005,4.6,Diesel,Automatic,80978,Used,16594.14,RAV4